---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RoutingPreferenceManager
source: html/4e7dff29-4a52-b18a-4e58-04572844dcc1.htm
---
# RoutingPreferenceManager Members

Adds a new routing preference rule to the rule group.